{"text": "Write a function to decode a run-length encoded given list."}
{"text": "Write a python function to find the frequency of the smallest value in a given array."}
{"text": "Write a function to interleave lists of the same length."}
{"text": "Write a function that matches a string that has an a followed by three 'b'."}
{"text": "Write a function to remove all elements from a given list present in another list."}
{"text": "Write a function to check if the given tuple has any none value or not."}
{"text": "Write a python function to find the average of cubes of first n natural numbers."}
{"text": "Write a function to calculate the sum of the negative numbers of a given list of numbers using lambda function."}
{"text": "Write a function to re-arrange the elements of the given array so that all negative elements appear before positive ones."}
{"text": "Write a python function to remove all occurrences of a character in a given string."}
{"text": "Write a python function to check whether the product of digits of a number at even and odd places is equal or not."}
{"text": "Write a python function to check whether the count of divisors is even or odd."}
{"text": "Write a function to remove leading zeroes from an ip address."}
{"text": "Write a python function to remove first and last occurrence of a given character from the string."}
{"text": "Write a python function to find sum of even index binomial coefficients."}
{"text": "Write a function to find the closest smaller number than n."}
{"text": "Write a python function to find the missing number in a sorted array."}
{"text": "Write a function to swap two numbers."}
{"text": "Write a function to find the cumulative sum of all the values that are present in the given tuple list."}
{"text": "Write a function to check whether the given string starts and ends with the same character or not using regex."}
{"text": "Write a python function to find odd numbers from a mixed list."}
{"text": "Write a python function to count number of cubes of size k in a cube of size n."}
{"text": "Write a function to find the list in a list of lists whose sum of elements is the highest."}
{"text": "Write a function to perform the adjacent element concatenation in the given tuples."}
{"text": "Write a function to check whether an element exists within a tuple."}
{"text": "Write a function to perform the exponentiation of the given two tuples."}
{"text": "Write a function to find the nth nonagonal number."}
{"text": "Write a python function to convert a list of multiple integers into a single integer."}
{"text": "Write a function to find the ascii value of total characters in a string."}
{"text": "Write a function to find all anagrams of a string in a given list of strings using lambda function."}
{"text": "Write a function to find the maximum of similar indices in two lists of tuples."}
{"text": "Write a function to sort a list of elements using radix sort."}
{"text": "Write a function to find the n'th star number."}
{"text": "Write a function to check if a substring is present in a given list of string values."}
{"text": "Write a function to find minimum number of coins that make a given value."}
{"text": "Write a python function to find lcm of two positive integers."}
{"text": "Write a function to flatten the given tuple matrix into the tuple list with each tuple representing each column."}
{"text": "Write a function to remove multiple spaces in a string by using regex."}
{"text": "Write a function to count the pairs of reverse strings in the given string list."}
{"text": "Write a python function to find the first digit in factorial of a given number."}
{"text": "Write a function to divide two lists using map and lambda function."}
{"text": "Write a function that matches a string that has an 'a' followed by anything, ending in 'b' by using regex."}
{"text": "Write a python function to find the sum of all even natural numbers within the range l and r."}
{"text": "Write a function to search a literals string in a string and also find the location within the original string where the pattern occurs."}
{"text": "Write a python function to find the sublist having minimum length."}
{"text": "Write a function to check if a url is valid or not using regex."}
{"text": "Write a function to find the second smallest number in a list."}
{"text": "Write a function to sort each sublist of strings in a given list of lists using lambda function."}
{"text": "Write a python function to check whether an array contains only one distinct element or not."}
{"text": "Write a python function to check whether the given string is a binary string or not."}
{"text": "Write a function to calculate the height of the given binary tree."}
{"text": "Write a python function to find the sum of even numbers at even positions."}
{"text": "Write a function to find the fixed point in the given array."}
{"text": "Write a function to convert rgb color to hsv color."}
{"text": "Write a function that matches a string that has an a followed by two to three 'b'."}
{"text": "Write a function to sort the given tuple list basis the total digits in tuple."}
{"text": "Write a python function to find sum of prime numbers between 1 to n."}
{"text": "Write a function to extract every specified element from a given two dimensional list."}
{"text": "Write a python function to find the element that appears only once in a sorted array."}
{"text": "Write a function to merge multiple sorted inputs into a single sorted iterator using heap queue algorithm."}
{"text": "Write a function to find the dissimilar elements in the given two tuples."}
{"text": "Write a function to calculate the area of a regular polygon."}
{"text": "Write a function to add the given list to the given tuples."}
{"text": "Write a function to check for the number of jumps required of given length to reach a point of form (d, 0) from origin in a 2d plane."}
