{"text": "Write a function to find the number of subsequences having product smaller than k for the given non negative array."}
{"text": "Write a function to find all index positions of the maximum values in a given list."}
{"text": "Write a python function to merge the first and last elements separately in a list of lists."}
{"text": "Write a function to find the difference of first even and odd number of a given list."}
{"text": "Write a function to remove the parenthesis area in a string."}
{"text": "Write a function to find the maximum difference between the number of 0s and number of 1s in any sub-string of the given binary string."}
{"text": "Write a function to find the minimum cost path to reach (m, n) from (0, 0) for the given cost matrix cost[][] and a position (m, n) in cost[][]."}
{"text": "Write a function to check if a dictionary is empty or not."}
{"text": "Write a python function to left rotate the string."}
{"text": "Write a python function to find the sum of hamming distances of all consecutive numbers from o to n."}
{"text": "Write a function to find a path with the maximum average over all existing paths for the given square matrix of size n*n."}
{"text": "Write a python function to find number of elements with odd factors in a given range."}
{"text": "Write a function to remove similar rows from the given tuple matrix."}
{"text": "Write a function to remove odd characters in a string."}
{"text": "Write a function to find numbers divisible by m or n from a list of numbers using lambda function."}
{"text": "Write a function to find the item with maximum frequency in a given list."}
{"text": "Write a python function to find the sum of the largest and smallest value in a given array."}
{"text": "Write a function to extract the frequency of unique tuples in the given list order irrespective."}
{"text": "Write a function to find the number of rotations in a circularly sorted array."}
{"text": "Write a function to sort a list of elements using pancake sort."}
{"text": "Write a function to find all anagrams of a string in a given list of strings using lambda function."}
{"text": "Write a python function to find the average of odd numbers till a given odd number."}
{"text": "Write a function to sort a list of elements using comb sort."}
{"text": "Write a python function to find the sum of the three lowest positive numbers from a given list of numbers."}
{"text": "Write a function to sort a given list of elements in ascending order using heap queue algorithm."}
{"text": "Write a function to sort a list of lists by a given index of the inner list."}
{"text": "Write a python function to count positive numbers in a list."}
{"text": "Write a function to move all zeroes to the end of the given array."}
{"text": "Write a function to count the most common character in a given string."}
{"text": "Write a python function to find sum of products of all possible subarrays."}
{"text": "Write a python function to find the length of the longest word."}
{"text": "Write a function to find the n - expensive price items from a given dataset using heap queue algorithm."}
{"text": "Write a python function to find the index of smallest triangular number with n digits."}
{"text": "Write a python function to print duplicants from a list of integers."}
{"text": "Write a python function to get the last element of each sublist."}
{"text": "Write a function for nth catalan number."}
{"text": "Write a python function to find the maximum length of sublist."}
{"text": "Write a python function to check whether all the characters are same or not."}
{"text": "Write a python function to find minimum number swaps required to make two binary strings equal."}
{"text": "Write a function to find the volume of a cube."}
{"text": "Write a function to remove duplicate words from a given string using collections module."}
{"text": "Write a function to iterate over elements repeating each as many times as its count."}
{"text": "Write a python function to count the pairs with xor as an odd number."}
{"text": "Write a python function to check whether the given string is made up of two alternating characters or not."}
{"text": "Write a python function to find the first maximum length of even word."}
{"text": "Write a function to sort a given mixed list of integers and strings."}
{"text": "Write a function to find the size of the given tuple."}
{"text": "Write a function to extract values between quotation marks of a string."}
{"text": "Write a function to access dictionary key’s element by index."}
{"text": "Write a function to generate a square matrix filled with elements from 1 to n raised to the power of 2 in spiral order."}
{"text": "Write a function to concatenate each element of tuple by the delimiter."}
{"text": "Write a function to check if a triangle of positive area is possible with the given angles."}
{"text": "Write a function to remove the matching tuples from the given two tuples."}
{"text": "Write a function to find the volume of a cuboid."}
{"text": "Write a python function to find the largest prime factor of a given number."}
{"text": "Write a function that matches a word containing 'z'."}
{"text": "Write a function to find all words starting with 'a' or 'e' in a given string."}
{"text": "Write a python function to remove even numbers from a given list."}
{"text": "Write a python function to check whether two given lines are parallel or not."}
{"text": "Write a function to check whether the given month name contains 31 days or not."}
{"text": "Write a python function to find smallest power of 2 greater than or equal to n."}
{"text": "Write a python function to find the element that appears only once in a sorted array."}
{"text": "Write a function to find the maximum sum possible by using the given equation f(n) = max( (f(n/2) + f(n/3) + f(n/4) + f(n/5)), n)."}
{"text": "Write a function to find the list of lists with minimum length."}
{"text": "Write a function to check whether it follows the sequence given in the patterns array."}
{"text": "Write a function to merge three dictionaries into a single expression."}
{"text": "Write a function where a string will start with a specific number."}
{"text": "Write a python function to count the occurrence of a given character in a string."}
{"text": "Write a function to find out the number of ways of painting the fence such that at most 2 adjacent posts have the same color for the given fence with n posts and k colors."}
{"text": "Write a python function to count the occurence of all elements of list in a tuple."}
{"text": "Write a function to sort a list of lists by length and value."}
{"text": "Write a python function to find the maximum of two numbers."}
{"text": "Write a function to find the sum of maximum increasing subsequence of the given array."}
{"text": "Write a python function to check whether the roots of a quadratic equation are numerically equal but opposite in sign or not."}
{"text": "Write a python function to find the sum of fourth power of first n even natural numbers."}
{"text": "Write a function to round the given number to the nearest multiple of a specific number."}
{"text": "Write a function to count those characters which have vowels as their neighbors in the given string."}
{"text": "Write a function to decode a run-length encoded given list."}
{"text": "Write a python function to check whether the frequency of each digit is less than or equal to the digit itself."}
{"text": "Write a python function to add a minimum number such that the sum of array becomes even."}
{"text": "Write a function to sort the given array by using shell sort."}
{"text": "Write a function to find the n-th rectangular number."}
{"text": "Write a python function to check whether the given number is even or not using bitwise operator."}
{"text": "Write a function to extract the even elements in the nested mixed tuple."}
{"text": "Write a function to replace all occurrences of spaces, commas, or dots with a colon in the given string by using regex."}
{"text": "Write a python function to find the smallest prime divisor of a number."}
{"text": "Write a python function to count set bits of a given number."}
{"text": "Write a function to sort a list in increasing order by the last element in each tuple from a given list of non-empty tuples."}
{"text": "Write a function to find minimum k records from tuple list."}
{"text": "Write a function to find sum and average of first n natural numbers."}
{"text": "Write a python function to find element at a given index after number of rotations."}
{"text": "Write a python function to count true booleans in the given list."}
{"text": "Write a python function to check whether every odd index contains odd numbers of a given list."}
{"text": "Write a function to multiply two lists using map and lambda function."}
{"text": "Write a function to convert polar coordinates to rectangular coordinates."}
{"text": "Write a function to find the difference between two consecutive numbers in a given list."}
{"text": "Write a function to find the summation of tuple elements in the given tuple list."}
{"text": "Write a python function to find even numbers from a mixed list."}
{"text": "Write a python function to move all zeroes to the end of the given list."}
{"text": "Write a function to extract the index minimum value record from the given tuples."}
{"text": "Write a python function to find the hamming distance between given two integers."}
{"text": "Write a function to assign frequency to each tuple in the given tuple list."}
{"text": "Write a python function to count the number of rectangles in a circle of radius r."}
{"text": "Write a python function to find the digit distance between two integers."}
{"text": "Write a python function to count the number of squares in a rectangle."}
{"text": "Write a python function to minimize the length of the string by removing occurrence of only one character."}
{"text": "Write a function to replace blank spaces with any character in a string."}
{"text": "Write a function to flatten the tuple list to a string."}
{"text": "Write a function to sort the given array by using heap sort."}
{"text": "Write a function to count the same pair in three given lists."}
{"text": "Write a function that matches a string that has an 'a' followed by anything, ending in 'b'."}
{"text": "Write a python function to find the slope of a line."}
{"text": "Write a python function to find a pair with highest product from a given array of integers."}
{"text": "Write a python function to calculate the product of all the numbers of a given tuple."}
{"text": "Write a function to group a sequence of key-value pairs into a dictionary of lists using collections module."}
{"text": "Write a python function to check whether a given sequence is linear or not."}
{"text": "Write a function to remove uppercase substrings from a given string by using regex."}
{"text": "Write a function to find number of odd elements in the given list using lambda function."}
{"text": "Write a function to perform the adjacent element concatenation in the given tuples."}
{"text": "Write a function to find the inversions of tuple elements in the given tuple list."}
{"text": "Write a python function to find the minimum difference between any two elements in a given array."}
{"text": "Write a function to substaract two lists using map and lambda function."}
{"text": "Write a function to check whether the given string is ending with only alphanumeric characters or not using regex."}
{"text": "Write a function to find the perimeter of a pentagon."}
{"text": "Write a function to count the frequency of consecutive duplicate elements in a given list of numbers."}
{"text": "Write a function to find the triplet with sum of the given array"}
{"text": "Write a function to find the smallest missing element in a sorted array."}
{"text": "Write a python function to find the frequency of a number in a given array."}
