{"text": "Write a function to split a list for every nth element."}
{"text": "Write a function to filter a dictionary based on values."}
{"text": "Write a function to find the perimeter of a rectangle."}
{"text": "Write a function to add the given tuple to the given list."}
{"text": "Write a python function to find the last digit in factorial of a given number."}
{"text": "Write a function to find the difference between two consecutive numbers in a given list."}
{"text": "Write a function to sort a given mixed list of integers and strings."}
{"text": "Write a function to remove specific words from a given list."}
{"text": "Write a function to find the lateral surface area of a cylinder."}
{"text": "Write a python function to find the first missing positive number."}
{"text": "Write a python function to find sum of inverse of divisors."}
{"text": "Write a function to iterate over all pairs of consecutive items in a given list."}
{"text": "Write a python function to find the sublist having minimum length."}
{"text": "Write a function to find the nth newman–shanks–williams prime number."}
{"text": "Write a python function to check whether the roots of a quadratic equation are numerically equal but opposite in sign or not."}
{"text": "Write a python function to count equal element pairs from the given array."}
{"text": "Write a function to merge three dictionaries into a single expression."}
{"text": "Write a function to count the number of inversions in the given array."}
{"text": "Write a python function to find the sum of the largest and smallest value in a given array."}
{"text": "Write a function to extract all the pairs which are symmetric in the given tuple list."}
{"text": "Write a function to check if a url is valid or not using regex."}
{"text": "Write a function to find the largest sum of contiguous subarray in the given array."}
{"text": "Write a function to check whether the given month name contains 30 days or not."}
{"text": "Write a function to add two lists using map and lambda function."}
{"text": "Write a python function to convert octal number to decimal number."}
{"text": "Write a function to find the area of a pentagon."}
{"text": "Write a python function to sort the given string."}
{"text": "Write a function to find all words which are at least 4 characters long in a string by using regex."}
{"text": "Write a function to get the length of a complex number."}
{"text": "Write a function to repeat the given tuple n times."}
{"text": "Write a python function to find the sum of fourth power of first n even natural numbers."}
{"text": "Write a function to split the given string with multiple delimiters by using regex."}
